var mysql = require('mysql');
var username = "xinhui"
var password = "yule8680"

module.exports = {
    pool: mysql.createPool({
        host: "172.17.0.4",
        port: 3306, //mysql端口
        user: 'root', //mysql用户名
        password: 'lovehyy', //mysql密码
        database: 'tgbotdice', //mysql数据库
        multipleStatements: true //不要改这个
    }),
    token: '6516458522:AAGqNMbmuQvWSsp_pXt47n71QAD-gxm0LGo', //机器人的token
    chatid: -1001805116376, //发送群或用户的id
    sxfqunid: -1001693033967,//上下分群id
    inline_keyboard: [ //内联键盘
        [{ text: '查看余额', callback_data: '6' }, { text: '最近投注', callback_data: '7' }],
        [{ text: '查看流水', callback_data: '8' }, { text: '领取反水', callback_data: '9' }],
        // [{ text: 'USDT自助充提', callback_data: '10', url: "https://t.me/" }],
        [{ text: '上下分群', callback_data: '11', url: "https://t.me/xinhuiyule6" }]

    ],
    betMin: 5.00, //单笔最小下注
    betMax: 5000.00, //单笔最大下注
    returnWater: 0.02, //反水比例，默认1.5%
    coin: " ", //货币单位
    gameTime: 1, //开奖间隔，请输入大于等于1的整数
    peilv: { //赔率设置
        dxds: 2, //大小单双
        fushi1: 3.5, //大单小双
        fushi2: 4.5, //小单大双
        baozi: 25, //豹子
        duizi: 2, //对子
        shunzi: 8, //顺子
        s3d: 188, // ADD 杀 3 点
        s4d: 58, //杀4点
        s5d: 28, //杀5点
        s6d: 16, //杀6点
        s7d: 12, //杀7点
        s8d: 8, //杀8点
        s9d: 7, //杀9点
        s10d: 6, //杀10点
        s11d: 6, //杀11点
        s12d: 7, //杀12点
        s13d: 8, //杀13点
        s14d: 12, //杀14点
        s15d: 16, //杀15点
        s16d: 28, //杀16点
        s17d: 58, //杀17点
        s18d: 188, // ADD 杀18点
        dsbz: 125, //点杀豹子
    },
    sendmode: "pt", //发送提醒消息的模式 pt:图片+文字 t:文字
    isfptx: true, //是否开启即将封盘提醒 false:关闭 true:开启
    istishishu: true, //是否在开奖结果展示输的用户投注 false:不展示 true:展示
    ishistorypicture: true, //是否开奖历史以图片的形式发送 false:否 true:是
}


/*

玩法
一、单式：
（赔率2倍）
（押注口令：玩法+金额）
例：单100
小 : 总点数为 4 至 10
大 : 总点数为 11 至 17
单 : 总点数为 5, 7, 9, 11, 13, 15, 17
双 : 总点数为 4, 6, 8, 10, 12, 14, 16
  （豹子不计入，押注限制封顶5000u）

二、复式  ：
（押注口令：玩法+金额）
例：大单100
大单：11, 13, 15, 17 点（赔率3.4倍）
小双：4, 6, 8, 10 点 （赔率3.4倍）
大双：12, 14, 16 点（赔率4.4倍）
小单：5, 7, 9 点 （赔率4.4倍）
 （豹子不计入，押注限制封顶5000u）


三、特殊玩法：
豹子下注：豹子100 （赔率25倍）
（押注限制封顶600U）
对子下注：对子100 （赔率2倍）
（押注限制封顶5000u）
顺子下注：顺子100 （赔率6倍）
（押注限制封顶1000U）

四、点杀玩法：
三颗骰子之和，即为点杀数
（押注口令:点数+杀+金额）
            例：15杀100
4、17点（赔率50倍）
5、16点（赔率25倍）
6、15点（赔率12倍）
7、14点（赔率12倍）
8、13点（赔率8倍）
9、10点（赔率6倍）
11、12点（赔率6倍）
（押注限制封顶10-500U）

五、点杀豹子玩法：
 （押注口令：点数+豹子+金额）
     例：1豹子100、2豹子100
各点数均为:1/2/3/4/5/6    （赔率125倍）
（押注限制封顶10-100U）
--------------------------------------
【特别提醒】：
1、出豹子庄家通杀（除押对豹子玩法和押对杀点数玩法其他通杀）*/


// --------------------------------------
// 【赔率】
// --------------------------------------
// 大小/ 单双 2倍
// 对子 : 2倍
// 开出豹子庄家通吃点杀除外
// 复式 :
// 大单 : 3.5倍 11, 13, 15, 17 点
// 小双 : 3.5倍 4, 6, 8, 10 点 
// 小单 : 4.5倍 5, 7, 9 点 
// 大双 : 4.5倍 12, 14, 16 点 
// 顺子 : 8倍
// 对子 : 2倍
// 开出豹子杀除外 庄家通吃点
// 3,18 倍率:188
// 4,17 倍率:58
// 5,16 倍率:28
// 6,15 倍率:16
// 7,14 倍率:12
// 8,13 倍率:8
// 9,12 倍率:7
// 10,11 倍率:6
// 豹子 : 32倍
// 豹子点杀188倍